ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC845-BRK/LPC845-BRK_SplitFlap/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v10.0
processor: LPC845
package_id: LPC845M301JBD48
mcu_data: ksdk2_0
processor_version: 10.0.0
board: LPC845BREAKOUT
pin_labels:
- {pin_num: '2', pin_signal: PIO0_13/ADC_10, label: 'CN1[26]/PIO0_13/ADC_10', identifier: M2_IN2}
- {pin_num: '6', pin_signal: PIO0_4/ADC_11, label: 'K3/CN1[35]/PIO0_4/ADC_11/TRSTN/WAKEUP', identifier: K3;MAG3}
- {pin_num: '7', pin_signal: PIO0_28/WKTCLKIN, label: 'CN1[14]/PIO0_28/WKTCLKIN', identifier: M1_IN3}
- {pin_num: '9', pin_signal: PIO0_31/CAPT_X0, label: S1/PIO0_31/CAPT_X0, identifier: CAPX}
- {pin_num: '12', pin_signal: PIO0_11/I2C0_SDA, label: 'CN1[24]/PIO0_11/I2C0_SDA', identifier: MAG1}
- {pin_num: '13', pin_signal: PIO0_10/I2C0_SCL, label: 'CN1[23]/PIO0_10/I2C0_SCL', identifier: MAG2}
- {pin_num: '15', pin_signal: PIO0_16, label: 'CN1[1]/PIO0_16', identifier: RS485_TXRX_EN}
- {pin_num: '17', pin_signal: PIO0_27, label: 'CN1[13]/PIO0_27', identifier: M1_IN2}
- {pin_num: '18', pin_signal: PIO0_26, label: 'CN1[12]/PIO0_26', identifier: M1_IN1}
- {pin_num: '22', pin_signal: PIO0_15, label: 'CN1[28]/PIO0_15', identifier: M3_IN4}
- {pin_num: '23', pin_signal: PIO1_4/CAPT_X5, label: PIO1_4/CAPT_X5, identifier: RS458_TXRX_EN}
- {pin_num: '24', pin_signal: PIO0_1/ACMP_I2/CLKIN, label: 'CN1[38]/PIO0_1/ACMP_I2/CLKIN/TDI', identifier: M3_IN2}
- {pin_num: '25', pin_signal: PIO0_9/XTALOUT, label: 'CN1[18]/CN1[22]/PIO0_9/XTALOUT', identifier: M2_IN3}
- {pin_num: '26', pin_signal: PIO0_8/XTALIN, label: 'CN1[19]/CN1[21]/PIO0_8/XTALIN', identifier: M2_IN4}
- {pin_num: '34', pin_signal: PIO0_6/ADC_1/ACMPVREF, label: 'CN1[33]/PIO0_6/ADC_1/ACMPVREF', identifier: M3_IN3}
- {pin_num: '36', pin_signal: PIO0_0/ACMP_I1, label: 'CN1[39]/PIO0_0/ACMP_I1/TDO', identifier: M3_IN1}
- {pin_num: '37', pin_signal: PIO0_14/ACMP_I3/ADC_2, label: 'CN1[27]/PIO0_14/ACMP_I3/ADC_2', identifier: M2_IN1}
- {pin_num: '38', pin_signal: PIO0_29/DACOUT_1, label: 'CN1[15]/PIO0_29/DACOUT_1', identifier: M1_IN4}
- {pin_num: '39', pin_signal: PIO0_23/ADC_3/ACMP_I4, label: 'CN1[8]/PIO0_23/ADC_3/ACMP_I4', identifier: M0_IN4}
- {pin_num: '42', pin_signal: PIO0_30/ACMP_I5, label: S1/PIO0_30/ACMP_I5, identifier: CAPY_R}
- {pin_num: '43', pin_signal: PIO0_22/ADC_4, label: 'CN1[7]/PIO0_22/ADC_4', identifier: M0_IN3}
- {pin_num: '44', pin_signal: PIO0_21/ADC_5, label: 'CN1[6]/PIO0_21/ADC_5', identifier: M0_IN2}
- {pin_num: '45', pin_signal: PIO0_20/ADC_6, label: 'CN1[5]/PIO0_20/ADC_6', identifier: M0_IN1}
- {pin_num: '46', pin_signal: PIO0_19/ADC_7, label: 'CN1[4]/PIO0_19/ADC_7', identifier: MAG0}
- {pin_num: '47', pin_signal: PIO0_18/ADC_8, label: 'CN1[3]/PIO0_18/ADC_8', identifier: RS458_RX}
- {pin_num: '48', pin_signal: PIO0_17/ADC_9/DACOUT_0, label: 'CN1[2]/PIO0_17/ADC_9/DACOUT_0', identifier: RS485_TX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_swm.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '20', peripheral: USART0, signal: RXD, pin_signal: PIO0_24}
  - {pin_num: '19', peripheral: USART0, signal: TXD, pin_signal: PIO0_25}
  - {pin_num: '38', peripheral: GPIO, signal: 'PIO0, 29', pin_signal: PIO0_29/DACOUT_1, direction: OUTPUT}
  - {pin_num: '7', peripheral: GPIO, signal: 'PIO0, 28', pin_signal: PIO0_28/WKTCLKIN, direction: OUTPUT}
  - {pin_num: '17', peripheral: GPIO, signal: 'PIO0, 27', pin_signal: PIO0_27, direction: OUTPUT}
  - {pin_num: '18', peripheral: GPIO, signal: 'PIO0, 26', pin_signal: PIO0_26, direction: OUTPUT}
  - {pin_num: '39', peripheral: GPIO, signal: 'PIO0, 23', pin_signal: PIO0_23/ADC_3/ACMP_I4, direction: OUTPUT}
  - {pin_num: '43', peripheral: GPIO, signal: 'PIO0, 22', pin_signal: PIO0_22/ADC_4, direction: OUTPUT}
  - {pin_num: '44', peripheral: GPIO, signal: 'PIO0, 21', pin_signal: PIO0_21/ADC_5, direction: OUTPUT}
  - {pin_num: '45', peripheral: GPIO, signal: 'PIO0, 20', pin_signal: PIO0_20/ADC_6, direction: OUTPUT}
  - {pin_num: '46', peripheral: GPIO, signal: 'PIO0, 19', pin_signal: PIO0_19/ADC_7, direction: INPUT}
  - {pin_num: '25', peripheral: GPIO, signal: 'PIO0, 9', pin_signal: PIO0_9/XTALOUT, direction: OUTPUT}
  - {pin_num: '15', peripheral: USART1, signal: RTS, pin_signal: PIO0_16}
  - {pin_num: '48', peripheral: USART1, signal: TXD, pin_signal: PIO0_17/ADC_9/DACOUT_0}
  - {pin_num: '47', peripheral: USART1, signal: RXD, pin_signal: PIO0_18/ADC_8}
  - {pin_num: '12', peripheral: GPIO, signal: 'PIO0, 11', pin_signal: PIO0_11/I2C0_SDA, direction: INPUT}
  - {pin_num: '26', peripheral: GPIO, signal: 'PIO0, 8', pin_signal: PIO0_8/XTALIN, direction: OUTPUT}
  - {pin_num: '13', peripheral: GPIO, signal: 'PIO0, 10', pin_signal: PIO0_10/I2C0_SCL, direction: INPUT}
  - {pin_num: '2', peripheral: GPIO, signal: 'PIO0, 13', pin_signal: PIO0_13/ADC_10, direction: OUTPUT}
  - {pin_num: '37', peripheral: GPIO, signal: 'PIO0, 14', pin_signal: PIO0_14/ACMP_I3/ADC_2, direction: OUTPUT}
  - {pin_num: '6', peripheral: GPIO, signal: 'PIO0, 4', pin_signal: PIO0_4/ADC_11, identifier: MAG3, direction: INPUT}
  - {pin_num: '36', peripheral: GPIO, signal: 'PIO0, 0', pin_signal: PIO0_0/ACMP_I1, direction: OUTPUT}
  - {pin_num: '24', peripheral: GPIO, signal: 'PIO0, 1', pin_signal: PIO0_1/ACMP_I2/CLKIN, direction: OUTPUT}
  - {pin_num: '34', peripheral: GPIO, signal: 'PIO0, 6', pin_signal: PIO0_6/ADC_1/ACMPVREF, direction: OUTPUT}
  - {pin_num: '22', peripheral: GPIO, signal: 'PIO0, 15', pin_signal: PIO0_15, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitPins(void)
{
    /* Enables clock for switch matrix.: enable */
    CLOCK_EnableClock(kCLOCK_Swm);
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    gpio_pin_config_t gpio0_pin0_0 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_0 (pin )  */
    GPIO_PinInit(GPIO, 0U, 0U, &gpio0_pin0_0);

    gpio_pin_config_t gpio0_pin0_1 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_1 (pin )  */
    GPIO_PinInit(GPIO, 0U, 1U, &gpio0_pin0_1);

    gpio_pin_config_t gpio0_pin0_4 = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_4 (pin )  */
    GPIO_PinInit(GPIO, 0U, 4U, &gpio0_pin0_4);

    gpio_pin_config_t gpio0_pin0_6 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_6 (pin )  */
    GPIO_PinInit(GPIO, 0U, 6U, &gpio0_pin0_6);

    gpio_pin_config_t gpio0_pin0_8 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_8 (pin )  */
    GPIO_PinInit(GPIO, 0U, 8U, &gpio0_pin0_8);

    gpio_pin_config_t gpio0_pin0_9 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_9 (pin )  */
    GPIO_PinInit(GPIO, 0U, 9U, &gpio0_pin0_9);

    gpio_pin_config_t gpio0_pin0_10 = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_10 (pin )  */
    GPIO_PinInit(GPIO, 0U, 10U, &gpio0_pin0_10);

    gpio_pin_config_t gpio0_pin0_11 = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_11 (pin )  */
    GPIO_PinInit(GPIO, 0U, 11U, &gpio0_pin0_11);

    gpio_pin_config_t gpio0_pin0_13 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_13 (pin )  */
    GPIO_PinInit(GPIO, 0U, 13U, &gpio0_pin0_13);

    gpio_pin_config_t gpio0_pin0_14 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_14 (pin )  */
    GPIO_PinInit(GPIO, 0U, 14U, &gpio0_pin0_14);

    gpio_pin_config_t gpio0_pin0_15 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_15 (pin )  */
    GPIO_PinInit(GPIO, 0U, 15U, &gpio0_pin0_15);

    gpio_pin_config_t gpio0_pin0_19 = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_19 (pin )  */
    GPIO_PinInit(GPIO, 0U, 19U, &gpio0_pin0_19);

    gpio_pin_config_t M0_IN1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_20 (pin 45)  */
    GPIO_PinInit(BOARD_INITPINS_M0_IN1_GPIO, BOARD_INITPINS_M0_IN1_PORT, BOARD_INITPINS_M0_IN1_PIN, &M0_IN1_config);

    gpio_pin_config_t M0_IN2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_21 (pin 44)  */
    GPIO_PinInit(BOARD_INITPINS_M0_IN2_GPIO, BOARD_INITPINS_M0_IN2_PORT, BOARD_INITPINS_M0_IN2_PIN, &M0_IN2_config);

    gpio_pin_config_t M0_IN3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_22 (pin 43)  */
    GPIO_PinInit(BOARD_INITPINS_M0_IN3_GPIO, BOARD_INITPINS_M0_IN3_PORT, BOARD_INITPINS_M0_IN3_PIN, &M0_IN3_config);

    gpio_pin_config_t M0_IN4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_23 (pin 39)  */
    GPIO_PinInit(BOARD_INITPINS_M0_IN4_GPIO, BOARD_INITPINS_M0_IN4_PORT, BOARD_INITPINS_M0_IN4_PIN, &M0_IN4_config);

    gpio_pin_config_t M1_IN1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_26 (pin 18)  */
    GPIO_PinInit(BOARD_INITPINS_M1_IN1_GPIO, BOARD_INITPINS_M1_IN1_PORT, BOARD_INITPINS_M1_IN1_PIN, &M1_IN1_config);

    gpio_pin_config_t M1_IN2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_27 (pin 17)  */
    GPIO_PinInit(BOARD_INITPINS_M1_IN2_GPIO, BOARD_INITPINS_M1_IN2_PORT, BOARD_INITPINS_M1_IN2_PIN, &M1_IN2_config);

    gpio_pin_config_t M1_IN3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_28 (pin 7)  */
    GPIO_PinInit(BOARD_INITPINS_M1_IN3_GPIO, BOARD_INITPINS_M1_IN3_PORT, BOARD_INITPINS_M1_IN3_PIN, &M1_IN3_config);

    gpio_pin_config_t M1_IN4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_29 (pin 38)  */
    GPIO_PinInit(BOARD_INITPINS_M1_IN4_GPIO, BOARD_INITPINS_M1_IN4_PORT, BOARD_INITPINS_M1_IN4_PIN, &M1_IN4_config);

    /* USART0_TXD connect to P0_25 */
    SWM_SetMovablePinSelect(SWM0, kSWM_USART0_TXD, kSWM_PortPin_P0_25);

    /* USART0_RXD connect to P0_24 */
    SWM_SetMovablePinSelect(SWM0, kSWM_USART0_RXD, kSWM_PortPin_P0_24);

    /* USART1_TXD connect to P0_17 */
    SWM_SetMovablePinSelect(SWM0, kSWM_USART1_TXD, kSWM_PortPin_P0_17);

    /* USART1_RXD connect to P0_18 */
    SWM_SetMovablePinSelect(SWM0, kSWM_USART1_RXD, kSWM_PortPin_P0_18);

    /* USART1_RTS connect to P0_16 */
    SWM_SetMovablePinSelect(SWM0, kSWM_USART1_RTS, kSWM_PortPin_P0_16);

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
